In [1]:
import pandas as pd

In [9]:
dfA = pd.read_csv("data/test.csv",  index_col=0)
dfB = pd.DataFrame()
dfB["국어"] = dfA["국어"]
dfB

     국어
이름
가영   83
나미   66
다윤  100
라희   60
미선   92
보민   96

In [14]:
dfA = pd.read_csv("data/test.csv", index_col=0)
dfB = pd.DataFrame()
# dfB.append(dfA.iloc[0]) # append메소드 지원하지 않음

In [19]:
# 열 삭제
dfA = pd.read_csv("data/test.csv", index_col=0)
dfA = dfA.drop("국어", axis=1)
dfA

    수학  영어  학생번호
이름
가영  89  76  A001
나미  93  75  B001
다윤  84  96  B002
라희  73  40  A002
미선  62  84  C001
보민  92  94  C002

In [24]:
# 행 삭제
dfA = pd.read_csv("data/test.csv", index_col=0)
dfA = dfA.drop(dfA.index[3])
dfA

     국어  수학  영어  학생번호
이름
가영   83  89  76  A001
나미   66  93  75  B001
다윤  100  84  96  B002
미선   92  62  84  C001
보민   96  92  94  C002

In [26]:
# 조건으로 데이터 추출
dfA = pd.read_csv("data/test.csv", index_col=0)
dfA["국어"] > 80

이름
가영     True
나미    False
다윤     True
라희    False
미선     True
보민     True
Name: 국어, dtype: bool

In [27]:
dfB = dfA[dfA["국어"] > 80]
dfB

     국어  수학  영어  학생번호
이름
가영   83  89  76  A001
다윤  100  84  96  B002
미선   92  62  84  C001
보민   96  92  94  C002

In [28]:
dfB = dfA[(dfA["국어"] > 80 & dfA["수학"] > 80])
dfB

SyntaxError: closing parenthesis ']' does not match opening parenthesis '(' (1184690074.py, line 1)